results/exp1/20260225T014131Z-vanilla-katran/raw/wrk/c4/run-2.txt
Running 1m test @ http://192.168.100.100:8080/exp1-1k.txt
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.72us   11.23us   1.55ms   81.27%
    Req/Sec    10.75k   826.78    12.91k    66.39%
  Latency Distribution
     50%   91.00us
     75%   97.00us
     90%  104.00us
     99%  125.00us
  2572393 requests in 1.00m, 3.05GB read
Requests/sec:  42802.34
Transfer/sec:     51.96MB